In [2]:
import pandas as pd

In [3]:
df=pd.read_csv('birth.csv')

In [4]:
df.head()

         date  births
0  1959-01-01      35
1  1959-01-02      32
2  1959-01-03      30
3  1959-01-04      31
4  1959-01-05      44

In [5]:
df['date'].dtype

dtype('O')

In [6]:
df2=pd.read_csv('birth.csv',parse_dates=[0]) # parse_dates=[0] makes the first column date_time format

In [7]:
df2.head()

        date  births
0 1959-01-01      35
1 1959-01-02      32
2 1959-01-03      30
3 1959-01-04      31
4 1959-01-05      44

In [8]:
df2['date'].dtype

dtype('<M8[ns]')

# Loading data as a series

In [9]:
series=pd.read_csv('birth.csv',header=0,parse_dates=[0],index_col=0,squeeze=True)    # parse_dates[0] because date is in the first column, first column indicates [0]. Then we need to make the date time column as our index

In [10]:
series.head()

date
1959-01-01    35
1959-01-02    32
1959-01-03    30
1959-01-04    31
1959-01-05    44
Name: births, dtype: int64

# Exploring Time Series Data

In [11]:
series.shape

(365,)

In [12]:
df2.shape

(365, 2)

# Querying by time

In [13]:
print(series['1959-01'])

date
1959-01-01    35
1959-01-02    32
1959-01-03    30
1959-01-04    31
1959-01-05    44
1959-01-06    29
1959-01-07    45
1959-01-08    43
1959-01-09    38
1959-01-10    27
1959-01-11    38
1959-01-12    33
1959-01-13    55
1959-01-14    47
1959-01-15    45
1959-01-16    37
1959-01-17    50
1959-01-18    43
1959-01-19    41
1959-01-20    52
1959-01-21    34
1959-01-22    53
1959-01-23    39
1959-01-24    32
1959-01-25    37
1959-01-26    43
1959-01-27    39
1959-01-28    35
1959-01-29    44
1959-01-30    38
1959-01-31    24
Name: births, dtype: int64

# Querying within a specific date

df2[(df2['date']>'1959-01-02') &(df2['date']<='1959-01-22')]

In [14]:
df2[(df2['date']>'1959-01-02') &(df2['date']<='1959-01-22')] #It shows the value in between 2nd January to 22 January

         date  births
2  1959-01-03      30
3  1959-01-04      31
4  1959-01-05      44
5  1959-01-06      29
6  1959-01-07      45
7  1959-01-08      43
8  1959-01-09      38
9  1959-01-10      27
10 1959-01-11      38
11 1959-01-12      33
12 1959-01-13      55
13 1959-01-14      47
14 1959-01-15      45
15 1959-01-16      37
16 1959-01-17      50
17 1959-01-18      43
18 1959-01-19      41
19 1959-01-20      52
20 1959-01-21      34
21 1959-01-22      53

In [15]:
series.describe()

count    365.000000
mean      41.980822
std        7.348257
min       23.000000
25%       37.000000
50%       42.000000
75%       46.000000
max       73.000000
Name: births, dtype: float64

In [16]:
df2.describe()

           births
count  365.000000
mean    41.980822
std      7.348257
min     23.000000
25%     37.000000
50%     42.000000
75%     46.000000
max     73.000000

# Feature Engineering
Date time feature
Lag Feature 
Window Feature 
Expanding Feature

df2.head()

In [17]:
df2

          date  births
0   1959-01-01      35
1   1959-01-02      32
2   1959-01-03      30
3   1959-01-04      31
4   1959-01-05      44
..         ...     ...
360 1959-12-27      37
361 1959-12-28      52
362 1959-12-29      48
363 1959-12-30      55
364 1959-12-31      50

[365 rows x 2 columns]

In [18]:
df2.head(5)

        date  births
0 1959-01-01      35
1 1959-01-02      32
2 1959-01-03      30
3 1959-01-04      31
4 1959-01-05      44

In [19]:
features=df2

In [20]:
features['year']=df2['date'].dt.year #using df2 dataframe to construct year feature using .dt.year

In [21]:
features['month']=df2['date'].dt.month # Creating month feature using dt.month

In [22]:
features['day']=df2['date'].dt.day    # Creating day feature by dt.day

In [23]:
features.head(5)

        date  births  year  month  day
0 1959-01-01      35  1959      1    1
1 1959-01-02      32  1959      1    2
2 1959-01-03      30  1959      1    3
3 1959-01-04      31  1959      1    4
4 1959-01-05      44  1959      1    5

# Lag Feature

In [27]:
features['lag1']=df2['births'].shift(1) # using this shift(1) method value of the previous row comes in the next row

In [28]:
features.head()

        date  births  year  month  day  lag1
0 1959-01-01      35  1959      1    1   NaN
1 1959-01-02      32  1959      1    2  35.0
2 1959-01-03      30  1959      1    3  32.0
3 1959-01-04      31  1959      1    4  30.0
4 1959-01-05      44  1959      1    5  31.0

In [29]:
features['lag2']=df2['births'].shift(365)

In [30]:
features.head(5)

        date  births  year  month  day  lag1  lag2
0 1959-01-01      35  1959      1    1   NaN   NaN
1 1959-01-02      32  1959      1    2  35.0   NaN
2 1959-01-03      30  1959      1    3  32.0   NaN
3 1959-01-04      31  1959      1    4  30.0   NaN
4 1959-01-05      44  1959      1    5  31.0   NaN

# Window Feature

In [34]:
features['Rolling_mean']=df2['births'].rolling(window=2).mean() # Average of previous 2 values

In [37]:
features['Rolling_max']=df2['births'].rolling(window=3).max()  #finding max value between current and previous 2 values ( total 3 window)

In [36]:
features.head()

        date  births  year  month  day  lag1  lag2  Rolling_mean  Rolling_max
0 1959-01-01      35  1959      1    1   NaN   NaN           NaN          NaN
1 1959-01-02      32  1959      1    2  35.0   NaN          33.5          NaN
2 1959-01-03      30  1959      1    3  32.0   NaN          31.0         35.0
3 1959-01-04      31  1959      1    4  30.0   NaN          30.5         32.0
4 1959-01-05      44  1959      1    5  31.0   NaN          37.5         44.0

# Expanding Features